using UnityEngine;
using System.Collections;

public class NameCreator
{
    private static string[] man_firstName;
    private static string[] wowan_firstName;
    private static string[] mid_name;
    private static string[] man_name_2;
    private static string[] man_name_3;
    private static string[] woman_name_2;
    private static string[] woman_name_3;

    public static void InitNames()
    {
        if (man_firstName == null)
        {
            man_firstName = new string[] { "王者", "叱咤", "傲视", "热血", "逍遥", "不败", "决战", "纵横", "无敌", "至尊", "征服", "风云", "倚天", "战神", "屠龙", "传奇", "血战", "名门", "战魂", "弑天", "血浴", "不灭", "乱世", "无情", "独霸", "狂战", "龙纹", "天尊", "噬魂", "惊世", "孤独", "乾坤", "惊天", "白日", "蟠龙", "烈光", "圣光", "斩情", "赤月", "断魂", "暗影", "狂龙", "龙吟", "无影", "天狼", "绝代", "武动", "至高", "赤日", "摧魂", "烈火", "霸主", "碎骨", "封魔", "灭神", "烈焰", "无极", "神魔", "闪电", "阎罗", "轰天", "苍炎", "虎爪", "兽王", "圣龙", "暗黑" };
            wowan_firstName = new string[] { "倾城", "妖魅", "夜魅", "沉鱼", "落雁", "闭月", "羞花", "傲娇", "妩媚", "女神", "萝莉", "小小", "完美", "国色", "花容", "楚楚", "冰雪", "可人", "腼腆", "羞涩", "秀外", "暗香", "贵族", "亭亭", "百媚", "幽幽", "玲珑", "娇娆", "典雅", "婀娜", "如花", "优雅", "紫霞", "相思", "明心", "水仙", "银月", "琉璃", "飞虹", "情殇", "碧云", "紫羽", "丹霞", "玄冰", "玄月", "清静", "缠心", "灵霄", "销魂", "锁心", "银霜", "玉女", "凤凰", "紫虹", "天仙", "夜叉", "赤霄", "青霞", "慕容", "桃花", "明心", "幽幻", "百变", "水镜", "苍空", "花雨", "金乌", "无双", "东方" };
            mid_name = new string[] { "の", "メ", "パ", "じ", "ぅ", "ぴ", "々", "⊙", "∫", "∮", "∽", "℃", "＄", "¤", "￠", "§", "№", "☆", "※", "灬" };
            man_name_2 = new string[] { "伟", "刚", "勇", "毅", "俊", "峰", "强", "军", "平", "保", "东", "文", "辉", "力", "明", "永", "健", "世", "广", "志", "义", "兴", "良", "海", "山", "仁", "波", "宁", "贵", "福", "生", "龙", "元", "全", "国", "胜", "学", "祥", "才", "发", "武", "新", "利", "清", "飞", "彬", "富", "顺", "信", "子", "杰", "涛", "昌", "成", "康", "星", "光", "天", "达", "安", "岩", "中", "茂", "进", "林", "有", "坚", "和", "彪", "博", "诚", "先", "敬", "震", "振", "壮", "会", "思", "群", "豪", "心", "邦", "承", "乐", "绍", "功", "松", "善", "厚", "庆", "磊", "民", "友", "裕", "河", "哲", "江", "超", "浩", "亮", "政", "谦", "亨", "奇", "固", "之", "轮", "翰", "朗", "伯", "宏", "言", "若", "鸣", "朋", "斌", "梁", "栋", "维", "启", "克", "伦", "翔", "旭", "鹏", "泽", "晨", "辰", "士", "以", "建", "家", "致", "树", "炎", "德", "行", "时", "泰", "盛", "雄", "琛", "钧", "冠", "策", "腾", "楠", "榕", "风", "航", "弘" };
            man_name_3 = new string[] { "泽", "灏", "野", "浚", "栋", "伟", "刚", "勇", "毅", "俊", "峰", "强", "军", "平", "保", "东", "文", "辉", "力", "明", "永", "健", "世", "广", "志", "义", "兴", "良", "海", "山", "仁", "波", "宁", "贵", "福", "生", "龙", "元", "全", "国", "胜", "学", "祥", "才", "发", "武", "新", "利", "清", "飞", "彬", "富", "顺", "信", "子", "杰", "涛", "昌", "成", "康", "星", "光", "天", "达", "安", "岩", "中", "茂", "进", "林", "有", "坚", "和", "彪", "博", "诚", "先", "敬", "震", "振", "壮", "会", "思", "群", "豪", "心", "邦", "承", "乐", "绍", "功", "松", "善", "厚", "庆", "磊", "民", "友", "裕", "河", "哲", "江", "超", "浩", "亮", "政", "谦", "亨", "奇", "固", "之", "轮", "翰", "朗", "伯", "宏", "言", "若", "鸣", "朋", "斌", "梁", "栋", "维", "启", "克", "伦", "翔", "旭", "鹏", "泽", "晨", "辰", "士", "以", "建", "家", "致", "树", "炎", "德", "行", "时", "泰", "盛", "雄", "琛", "钧", "冠", "策", "腾", "楠", "榕", "风", "航", "弘", "潮" };
            woman_name_2 = new string[] { "秀", "娟", "英", "华", "慧", "巧", "美", "娜", "静", "淑", "惠", "珠", "翠", "雅", "芝", "玉", "萍", "红", "娥", "玲", "芬", "芳", "燕", "彩", "春", "菊", "兰", "凤", "洁", "梅", "琳", "素", "云", "莲", "真", "环", "雪", "荣", "爱", "妹", "霞", "香", "月", "莺", "媛", "艳", "瑞", "凡", "佳", "嘉", "琼", "勤", "珍", "贞", "莉", "桂", "娣", "叶", "璧", "璐", "娅", "琦", "晶", "妍", "茜", "秋", "珊", "莎", "锦", "黛", "青", "倩", "婷", "姣", "婉", "娴", "瑾", "颖", "露", "瑶", "怡", "婵", "雁", "蓓", "纨", "仪", "荷", "丹", "蓉", "眉", "君", "琴", "蕊", "薇", "菁", "梦", "岚", "苑", "婕", "馨", "瑗", "琰", "韵", "融", "园", "艺", "咏", "卿", "聪", "澜", "纯", "毓", "悦", "昭", "冰", "爽", "琬", "茗", "羽", "希", "宁", "欣", "飘", "育", "滢", "馥", "筠", "柔", "竹", "霭", "凝", "晓", "欢", "霄", "枫", "芸", "菲", "寒", "伊", "亚", "宜", "可", "姬", "舒", "影", "荔", "枝", "思", "丽" };
            woman_name_3 = new string[] { "筠", "柔", "竹", "霭", "凝", "晓", "欢", "霄", "枫", "芸", "菲", "寒", "伊", "亚", "宜", "可", "姬", "舒", "影", "荔", "枝", "思", "丽", "秀", "娟", "英", "华", "慧", "巧", "美", "娜", "静", "淑", "惠", "珠", "翠", "雅", "芝", "玉", "萍", "红", "娥", "玲", "芬", "芳", "燕", "彩", "春", "菊", "勤", "珍", "贞", "莉", "兰", "凤", "洁", "梅", "琳", "素", "云", "莲", "真", "环", "雪", "荣", "爱", "妹", "霞", "香", "月", "莺", "媛", "艳", "瑞", "凡", "佳", "嘉", "琼", "桂", "娣", "叶", "璧", "璐", "娅", "琦", "晶", "妍", "茜", "秋", "珊", "莎", "锦", "黛", "青", "倩", "婷", "姣", "婉", "娴", "瑾", "颖", "露", "瑶", "怡", "婵", "雁", "蓓", "纨", "仪", "荷", "丹", "蓉", "眉", "君", "琴", "蕊", "薇", "菁", "梦", "岚", "苑", "婕", "馨", "瑗", "琰", "韵", "融", "园", "艺", "咏", "卿", "聪", "澜", "纯", "毓", "悦", "昭", "冰", "爽", "琬", "茗", "羽", "希", "宁", "欣", "飘", "育", "滢", "馥" };
        }
	}

    public static void ClearNames()
    {
        man_firstName = null;
        wowan_firstName = null;
        mid_name = null;
        man_name_2 = null;
        man_name_3 = null;
        woman_name_2 = null;
        woman_name_3 = null;
    }

    public static string RandomName(int sex = 1)
    {
		string name = "";
		if (sex == 1)
        {
			name  = man_firstName[(int)(man_firstName.Length * RandomRangle())] + mid_name[(int)(mid_name.Length * RandomRangle())] + man_name_2[(int)(man_name_2.Length * RandomRangle())] + man_name_3[(int)(man_name_3.Length * RandomRangle())];
		}else
        {
            name = wowan_firstName[(int)(wowan_firstName.Length * RandomRangle())] + mid_name[(int)(mid_name.Length * RandomRangle())] + woman_name_2[(int)(woman_name_2.Length * RandomRangle())] + woman_name_3[(int)(woman_name_3.Length * RandomRangle())];
		}
		return name;
	}

    private static float RandomRangle()
    {
        return Random.Range(0f,1.0f);
    }
}
